In [128]:
import pandas as pd
import numpy as np

import csv
import news_rec as nr

In [129]:
def load_tsv(file, cols):
    '''
    '''
    df = pd.read_table(file,sep="\t", header=None, names=cols)

    return df

In [130]:
def get_data(file):
    df = pd.read_csv(file)
    
    return df

In [133]:
behav_cols = ["impression_id", "user_id","time","history","impressions"]
news_cols = ["news_id","category","sub_category","title","abstract","url","title_entities","abstract_entitites"]
news_df = load_tsv("./data/news.tsv", news_cols)
b_df = load_tsv("./data/behaviors.tsv", behav_cols)

In [131]:
hist, can = nr.all_preprocessing()

(509586, 6) (827783, 7)

In [6]:
nn_result = get_data("./results/final/nn_cosine3_final.csv")
#nn_result = nn_result.rename(columns={"prediction":"nn_pred"}) 
nn_result.head(5)

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U27158,"['N64174', 'N23877', 'N48017', 'N9623', 'N50872']",N64174,N23877,N48017,N9623,N50872
1,U60170,"['N38779', 'N23446', 'N45523', 'N25165', 'N457...",N38779,N23446,N45523,N25165,N45734
2,U40758,"['N23446', 'N40109', 'N38779', 'N62318', 'N341...",N23446,N40109,N38779,N62318,N34185
3,U60555,"['N23446', 'N23877', 'N38779', 'N6477', 'N45523']",N23446,N23877,N38779,N6477,N45523
4,U57993,"['N23446', 'N57733', 'N47652', 'N38779', 'N455...",N23446,N57733,N47652,N38779,N45523

In [7]:
sts_result = get_data("./results/final/sts_cosine3_final.csv")
#nn_result = nn_result.rename(columns={"prediction":"nn_pred"}) 
sts_result.head(5)

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U57255,"['N64037', 'N46917', 'N60750', 'N22975', 'N500...",N64037,N46917,N60750,N22975,N50055
1,U66830,"['N62318', 'N19661', 'N40109', 'N50872', 'N341...",N62318,N19661,N40109,N50872,N34185
2,U25497,"['N41934', 'N61233', 'N56211', 'N14478', 'N277...",N41934,N61233,N56211,N14478,N27737
3,U27158,"['N50872', 'N9623', 'N48017', 'N8015', 'N64174']",N50872,N9623,N48017,N8015,N64174
4,U89637,"['N23446', 'N50872', 'N6477', 'N29212', 'N38779']",N23446,N50872,N6477,N29212,N38779

In [8]:
nli_result = get_data("./results/final/nli_cosine3_final.csv")
#nn_result = nn_result.rename(columns={"prediction":"nn_pred"}) 
nli_result.head(5)

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U57255,"['N46917', 'N64037', 'N60750', 'N50055', 'N229...",N46917,N64037,N60750,N50055,N22975
1,U66830,"['N62318', 'N1539', 'N40109', 'N50872', 'N38779']",N62318,N1539,N40109,N50872,N38779
2,U25497,"['N56211', 'N14478', 'N41934', 'N61233', 'N528...",N56211,N14478,N41934,N61233,N52867
3,U27158,"['N64174', 'N8015', 'N9623', 'N23877', 'N48017']",N64174,N8015,N9623,N23877,N48017
4,U89637,"['N23446', 'N50872', 'N23877', 'N6477', 'N38779']",N23446,N50872,N23877,N6477,N38779

In [134]:
nn_result_news = get_data("./results/final/nn_cosine3_final_news.csv")
#nn_result = nn_result.rename(columns={"prediction":"nn_pred"}) 
nn_result.head(5)

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U27158,"['N64174', 'N23877', 'N48017', 'N9623', 'N50872']",N64174,N23877,N48017,N9623,N50872
1,U60170,"['N38779', 'N23446', 'N45523', 'N25165', 'N457...",N38779,N23446,N45523,N25165,N45734
2,U40758,"['N23446', 'N40109', 'N38779', 'N62318', 'N341...",N23446,N40109,N38779,N62318,N34185
3,U60555,"['N23446', 'N23877', 'N38779', 'N6477', 'N45523']",N23446,N23877,N38779,N6477,N45523
4,U57993,"['N23446', 'N57733', 'N47652', 'N38779', 'N455...",N23446,N57733,N47652,N38779,N45523

In [135]:
sts_result_news = get_data("./results/final/sts_cosine3_final_news.csv")
#nn_result = nn_result.rename(columns={"prediction":"nn_pred"}) 
sts_result.head(5)

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U57255,"['N64037', 'N46917', 'N60750', 'N22975', 'N500...",N64037,N46917,N60750,N22975,N50055
1,U66830,"['N62318', 'N19661', 'N40109', 'N50872', 'N341...",N62318,N19661,N40109,N50872,N34185
2,U25497,"['N41934', 'N61233', 'N56211', 'N14478', 'N277...",N41934,N61233,N56211,N14478,N27737
3,U27158,"['N50872', 'N9623', 'N48017', 'N8015', 'N64174']",N50872,N9623,N48017,N8015,N64174
4,U89637,"['N23446', 'N50872', 'N6477', 'N29212', 'N38779']",N23446,N50872,N6477,N29212,N38779

## Metric Meausures

In [11]:
def get_acc(candidate, preds):
    

    results_df = candidate.merge(preds, left_on =["user_id","news_id"], right_on =["user_id","pred_1"] )

    correct_preds = results_df.loc[results_df["label"]=='1'].shape[0]
    accuracy = correct_preds/results_df.shape[0]

    return accuracy

In [35]:
nn_acc = get_acc(can, nn_result)
nn_acc # previously was .059

0.25

In [132]:
nn_acc

NameError: name 'nn_acc' is not defined

In [36]:
sts_acc = get_acc(can, sts_result)
sts_acc # previously was .059

0.23725834797891038

In [12]:
nli_acc = get_acc(can, nli_result)
nli_acc # previously was .059

0.22300884955752212

In [13]:
nn_acc_news = get_acc(can, nn_result_news)
nn_acc_news

0.14

In [14]:
sts_acc_news = get_acc(can, sts_result_news)
sts_acc_news # previously was .059

0.1875

In [15]:
def convert_recs_to_list(preds, candidate, cols):
    new_col_names = []
    all_df = []
    for c in cols:
        new_col = c + "_relevant_ind"
        new_col_names.append(new_col)
        results_df = candidate.merge(preds, left_on =["user_id","news_id"], right_on =["user_id",c] )

        results_df = results_df.rename(columns={"label":new_col})
        results_df[new_col] = results_df[new_col].astype('int64')
        results_df = results_df[['user_id',new_col]]
        #print(results_df.head())
        all_df.append(results_df)
    # combine all dfs into one large df
    df = all_df[0]
    for d in all_df[1:]:
        df = df.merge(d, on='user_id')

    df["combined"] = df[new_col_names].values.tolist()
    return df

In [16]:
def precision_at_k(df, k):
    col = "P@"+str(k)

    df[col] = df["combined"].str[:k].map(sum)
    df[col] = df[col]/k
    return df,col

In [17]:
def apk(df, k):
    cols = []
    for i in range(1, k+1):
        df,col = precision_at_k(df, i)
        cols.append(col)
    
    df["ap"] = df[cols].sum(axis=1)
    df["ap"] = df["ap"] /k
    return df

In [18]:
def mapK(preds,candidate, cols,k):
    df = convert_recs_to_list(preds, candidate, cols)
    df = apk(df, k)
    total = df["ap"].sum()
    return total/df.shape[0], df

In [37]:
mapk3, df = mapK(nn_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],3)
mapk3

0.20235042735042735

In [38]:
mapk5, df5 =mapK(nn_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],5)
mapk5

0.18325641025641023

In [19]:
mapk1, df1 = mapK(nn_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],1)
mapk1

0.25

In [40]:
print("NN 1",mapk1)
print("NN 3",mapk3)
print("NN 5",mapk5)

NN 1 0.25
NN 3 0.20235042735042735
NN 3 0.18325641025641023

In [42]:
sts_mapk3, df = mapK(sts_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],3)
sts_mapk5, df = mapK(sts_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],5)
sts_mapk1, df = mapK(sts_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],1)
print("STS 1",sts_mapk1)
print("STS 3",sts_mapk3)
print("STS 5",sts_mapk5)

STS 1 0.23725834797891038
STS 3 0.21568053114626048
STS 5 0.19995313415348565

In [20]:
nli_mapk3, df = mapK(nli_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],3)
nli_mapk5, df = mapK(nli_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],5)
nli_mapk1, df = mapK(nli_result, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],1)
print("NLI 1",nli_mapk1)
print("NLI 3",nli_mapk3)
print("NLI 3",nli_mapk5)

NLI 1 0.22300884955752212
NLI 3 0.2081612586037365
NLI 3 0.19296755162241888

In [22]:
sts_mapk3_news, df = mapK(sts_result_news, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],3)
sts_mapk5_news, df = mapK(sts_result_news, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],5)
sts_mapk1_news, df = mapK(sts_result_news, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],1)
print("STS News 1",sts_mapk1_news)
print("STS News 3",sts_mapk3_news)
print("STS News 5",sts_mapk5_news)

STS News 1 0.16981132075471697
STS News 3 0.16561844863731653
STS News 5 0.14257861635220126

In [23]:
nn_mapk3_news, df = mapK(nn_result_news, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],3)
nn_mapk5_news, df = mapK(nn_result_news, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],5)
nn_mapk1_news, df = mapK(nn_result_news, can, ["pred_1", "pred_2","pred_3","pred_4","pred_5"],1)
print("NN News 1",nn_mapk1_news)
print("NN News 3",nn_mapk3_news)
print("NN News 5",nn_mapk5_news)

NN News 1 0.14634146341463414
NN News 3 0.12059620596205961
NN News 5 0.1189430894308943

In [ ]:
# bias in data. Assumption that history of only news, means they would only wnat news in the future.

## Get Examples

In [24]:
nn_result.head()

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U27158,"['N64174', 'N23877', 'N48017', 'N9623', 'N50872']",N64174,N23877,N48017,N9623,N50872
1,U60170,"['N38779', 'N23446', 'N45523', 'N25165', 'N457...",N38779,N23446,N45523,N25165,N45734
2,U40758,"['N23446', 'N40109', 'N38779', 'N62318', 'N341...",N23446,N40109,N38779,N62318,N34185
3,U60555,"['N23446', 'N23877', 'N38779', 'N6477', 'N45523']",N23446,N23877,N38779,N6477,N45523
4,U57993,"['N23446', 'N57733', 'N47652', 'N38779', 'N455...",N23446,N57733,N47652,N38779,N45523

In [25]:
can[can["user_id"] == "U27158"] # Good example of a hit, but only one hit

,user_id,date,news_id,label,category,sub_category,title
6835,U27158,2019-11-14,N23877,0,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Car of Marine linked to Virginia slaying is fo...
34346,U27158,2019-11-14,N64174,1,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Georgia executes man convicted of killing conv...
60825,U27158,2019-11-14,N48017,0,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Experts crack mystery of ancient Egypt's sacre...
65234,U27158,2019-11-14,N8015,0,"[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Powell's Warning to Congress About the Next Re...
75329,U27158,2019-11-14,N40109,0,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",This Arctic blast is in its final day. But the...
120558,U27158,2019-11-14,N50872,0,"[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",50 amazing gifts for every type of person and ...
185452,U27158,2019-11-14,N9623,0,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Israel says overnight strike on Gaza house kil...

In [73]:
news_df[news_df["news_id"]=="N64174"]["title"].to_list()[0]

'Georgia executes man convicted of killing convenience store clerk'

In [82]:
hist[hist["user_id"] == "U27158"]

,user_id,date,news_id,category,sub_category,title
533,U27158,2019-11-14,N46616,"[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",The best sandwich shop in every US state and DC
90417,U27158,2019-11-14,N16215,"[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",National Dessert Day: Where to get Free Desser...
254088,U27158,2019-11-14,N10120,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Salmonella linked to ground beef
257098,U27158,2019-11-14,N18275,"[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Jennifer Lopez Wore an Over-the-Top Sequined S...
273485,U27158,2019-11-14,N7376,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",AP source: Phillies agree to hire Joe Girardi ...
298852,U27158,2019-11-14,N49103,"[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",11 surprising things you didn't know about Oli...
326116,U27158,2019-11-14,N8745,"[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",The One Thing Kourtney Kardashian Drinks Every...
436676,U27158,2019-11-14,N55000,"[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",We compared Popeyes' discontinued chicken Po' ...
489779,U27158,2019-11-14,N36637,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Saudi Arabia says it is not behind Iranian tan...

In [75]:
U27158_hist =hist[hist["user_id"] == "U27158"]["title"].to_list()
for t in U27158_hist:
    print(t)

The best sandwich shop in every US state and DC
National Dessert Day: Where to get Free Dessert at Wendy's, TGI Friday and More
Salmonella linked to ground beef
Jennifer Lopez Wore an Over-the-Top Sequined Slit Dress to Work
AP source: Phillies agree to hire Joe Girardi as manager
11 surprising things you didn't know about Olive Garden
The One Thing Kourtney Kardashian Drinks Every Morning for Younger-Looking Skin
We compared Popeyes' discontinued chicken Po' Boy to its new fried chicken sandwich
Saudi Arabia says it is not behind Iranian tanker struck in Red Sea

In [62]:
nn_result[nn_result["user_id"] == "U27158"] # first ranking is the hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
0,U27158,"['N64174', 'N23877', 'N48017', 'N9623', 'N50872']",N64174,N23877,N48017,N9623,N50872

In [64]:
sts_result[sts_result["user_id"] == "U27158"] # last ranking is the hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
3,U27158,"['N50872', 'N9623', 'N48017', 'N8015', 'N64174']",N50872,N9623,N48017,N8015,N64174

In [66]:
nli_result[nli_result["user_id"] == "U27158"] # first ranking is a hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
3,U27158,"['N64174', 'N8015', 'N9623', 'N23877', 'N48017']",N64174,N8015,N9623,N23877,N48017

In [74]:
nn_result_news[nn_result_news["user_id"] == "U27158"]

Empty DataFrame
Columns: [user_id, preds, pred_1, pred_2, pred_3, pred_4, pred_5]
Index: []

## Another Example

In [54]:
labels = can[can["label"]=="1"]
user_labels = labels.groupby(["user_id"])["user_id"].size().reset_index(name='counts')
user_labels.sort_values(by=["counts"])
small_labels = user_labels[user_labels["counts"] ==2]

In [48]:

small_hist = hist.groupby(["user_id"])["user_id"].size().reset_index(name='counts')

small_hist = small_hist[small_hist["counts"] <=10]
small_hist

      user_id  counts
0       U1000       3
3      U10016       4
7      U10026       6
9      U10030       6
10     U10032       8
...       ...     ...
19696   U9983       3
19697   U9988       1
19699   U9991       4
19700   U9993       2
19702   U9996       5

[7261 rows x 2 columns]

In [55]:
# get the same
potential= set(small_labels["user_id"].to_list()).intersection(set(small_hist["user_id"].to_list()))
set(nn_result["user_id"].to_list()).intersection(potential)

{'U10056',
 'U18205',
 'U19082',
 'U25653',
 'U26127',
 'U26384',
 'U26584',
 'U32069',
 'U41661',
 'U55722',
 'U58683',
 'U62590',
 'U69594',
 'U77167',
 'U80182',
 'U84475',
 'U87295',
 'U89702',
 'U89775',
 'U93721'}

In [87]:
can[(can["user_id"] == "U89702") & (can["label"] == "1")]

,user_id,date,news_id,label,category,sub_category,title
721946,U89702,2019-11-14,N2235,1,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","LA Sweep: Angels' Trout, Dodgers' Bellinger wi..."
729244,U89702,2019-11-14,N64037,1,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Supermassive black hole ejects star from Milky...

In [94]:
news_df[news_df["news_id"]=="N64037"]["title"].to_list()[0]

'Supermassive black hole ejects star from Milky Way Galaxy'

In [88]:
nn_result[(nn_result["user_id"] == "U89702")] # last value a hit. Second article not hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
145,U89702,"['N47652', 'N46917', 'N41934', 'N2960', 'N50055']",N47652,N46917,N41934,N2960,N50055

In [89]:
sts_result[(sts_result["user_id"] == "U89702")]

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
300,U89702,"['N47652', 'N50055', 'N2235', 'N2960', 'N22975']",N47652,N50055,N2235,N2960,N22975

In [90]:
nli_result[(nli_result["user_id"] == "U89702")]

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
302,U89702,"['N50055', 'N22975', 'N27737', 'N2960', 'N47652']",N50055,N22975,N27737,N2960,N47652

In [56]:
can[(can["user_id"] == "U10056") & (can["label"] == "1")]

,user_id,date,news_id,label,category,sub_category,title
416281,U10056,2019-11-14,N61233,1,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Nor'easter to grind at US East Coast this weekend
661802,U10056,2019-11-14,N16118,1,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",There are 14 cheap days to fly left in 2019: W...

In [57]:
hist[(hist["user_id"] == "U10056")]

,user_id,date,news_id,category,sub_category,title
98711,U10056,2019-11-14,N58518,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Former President Jimmy Carter suffers pelvic f...
150584,U10056,2019-11-14,N54536,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",4 High School Students Killed in Texas Car Cra...
168747,U10056,2019-11-14,N7046,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",50 Budget-Friendly RV Campgrounds to Check Out
209444,U10056,2019-11-14,N54822,"[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","If You Don't Eat a Banana Every Day, This Migh..."
249101,U10056,2019-11-14,N34331,"[1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, ...","Tesla ""Cybertruck"" Electric Pickup Debut Set F..."
261979,U10056,2019-11-14,N26727,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",'I like my body and that's all that really mat...

In [58]:
nn_result[(nn_result["user_id"] == "U10056")] # last value a hit. Second article not hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
209,U10056,"['N52867', 'N45523', 'N56211', 'N1031', 'N16118']",N52867,N45523,N56211,N1031,N16118

In [59]:
sts_result[(sts_result["user_id"] == "U10056")] # last article a hit. Second article not a hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
435,U10056,"['N56211', 'N1031', 'N14478', 'N52867', 'N16118']",N56211,N1031,N14478,N52867,N16118

In [61]:
nli_result[(nli_result["user_id"] == "U10056")] # prediction ranked hiring, but second article not a hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
436,U10056,"['N56211', 'N27737', 'N16118', 'N41934', 'N528...",N56211,N27737,N16118,N41934,N52867

In [ ]:
## Example 2

In [67]:
can[(can["user_id"] == "U18205") & (can["label"] == "1")]

,user_id,date,news_id,label,category,sub_category,title
66376,U18205,2019-11-14,N8015,1,"[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",Powell's Warning to Congress About the Next Re...
78277,U18205,2019-11-14,N40109,1,"[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...",This Arctic blast is in its final day. But the...

In [86]:
news_df[news_df["news_id"]=="N40109"]["title"].to_list()[0]

"This Arctic blast is in its final day. But the cold isn't over quite yet"

In [68]:
nn_result[(nn_result["user_id"] == "U18205")] # no hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
43,U18205,"['N64174', 'N23877', 'N48017', 'N8015', 'N50872']",N64174,N23877,N48017,N8015,N50872

In [69]:
sts_result[(sts_result["user_id"] == "U18205")] # both hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
94,U18205,"['N23877', 'N48017', 'N40559', 'N40109', 'N8015']",N23877,N48017,N40559,N40109,N8015

In [70]:
nli_result[(nli_result["user_id"] == "U18205")] # both hit

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
97,U18205,"['N64174', 'N8015', 'N48017', 'N23877', 'N50872']",N64174,N8015,N48017,N23877,N50872

## Examples from Last Experiment

In [147]:
nn_result_news["user_id"].to_list()[20:40]

['U7166',
 'U27916',
 'U13035',
 'U35908',
 'U81464',
 'U47748',
 'U64616',
 'U10731',
 'U20454',
 'U53090',
 'U12509',
 'U52602',
 'U36447',
 'U31003',
 'U91571',
 'U25823',
 'U22845',
 'U39900',
 'U76497',
 'U50973']

In [148]:
b_df[b_df["user_id"]=="U7166"]["impressions"].to_list()

['N34876-0 N4913-0 N13907-0 N26025-1 N21420-0 N51048-0 N39010-0 N287-0 N59673-0 N4642-0 N47061-0']

In [152]:
news_df[(news_df["news_id"]=="N26025")]#["title"].to_list()[0]#| (news_df["news_id"]=="N4107")]["title"].to_list()[1]

,news_id,category,sub_category,title,abstract,url,title_entities,abstract_entitites
45132,N26025,news,newspolitics,"Bannon calls Pelosi's impeachment strategy ""ac...","Bannon, the former White House chief strategis...",https://assets.msn.com/labs/mind/BBWF67N.html,"[{""Label"": ""Steve Bannon"", ""Type"": ""P"", ""Wikid...","[{""Label"": ""Steve Bannon"", ""Type"": ""P"", ""Wikid..."

In [149]:
nn_result_news[nn_result_news["user_id"]=="U7166"]

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
20,U7166,"['N39010', 'N51048', 'N287', 'N26025', 'N59673']",N39010,N51048,N287,N26025,N59673

In [150]:
sts_result_news[sts_result_news["user_id"]=="U7166"]

,user_id,preds,pred_1,pred_2,pred_3,pred_4,pred_5
25,U7166,"['N39010', 'N287', 'N26025', 'N51048', 'N4642']",N39010,N287,N26025,N51048,N4642

## Getting Good Users

In [32]:
prev_nn = get_data("./results/cosine3_final.csv")
prev_nn.merge(nn_result,left_on =["user_id"], right_on =["user_id"]).head() # none
exp_users =prev_nn["user_id"].unique()
user_file = './users.csv'
users = pd.DataFrame(data={"user_id":exp_users[:1000]})
users.to_csv(user_file, sep=',', index=False)

## Break down the results

## join the preds

In [13]:
all_results = pd.merge(pd.merge(nn_result,nli_result,on='user_id'),sts_result,on='user_id')
all_results.head()

  user_id nn_pred nli_pred sts_pred
0  U57255  N46917   N64037   N64037
1  U66830  N40109   N34185   N62318
2  U25497  N56211   N41934   N41934
3  U89637  N23446   N23446   N23446
4   U9318  N23877   N36226   N40109

In [14]:
all_results.shape

(538, 4)

In [15]:
# make date field
b_df["date"] = pd.to_datetime(b_df["time"]).dt.date
b_df["date"]

0         2019-11-11
1         2019-11-12
2         2019-11-14
3         2019-11-11
4         2019-11-12
             ...
156960    2019-11-14
156961    2019-11-13
156962    2019-11-14
156963    2019-11-13
156964    2019-11-14
Name: date, Length: 156965, dtype: object

In [ ]:
# reduce date to only the last date
#b_df = b_df.loc[b_df["date"].astype(str) == "2019-11-14"]

In [ ]:
# History Will be the users historical articles combined with news relating info
history_df_cols = [ "user_id","date","history"]
candidate_df_cols = [ "user_id","date","impressions"]

history_df = b_df[history_df_cols].copy(deep=True)
candidate_df = b_df[candidate_df_cols].copy(deep=True)

In [ ]:
def create_rows(df, col):
    '''
    '''
    # first convert string into a list/array
    df[col] = df[col].str.split()

    # explored into multiple rows
    new_df = df.explode(col)
    return new_df
candidate_df = create_rows(candidate_df, "impressions")
history_df = create_rows(history_df, "history")
history_df = history_df.rename(columns={"history":"news_id"}) # rename history column for joining to news df